Revit 2024 API
WallUtils Class
 General Wall utility methods
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class WallUtils
Visual Basic
Public NotInheritable Class WallUtils
Visual C++
public ref class WallUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WallUtils
See Also
WallUtils Members
Autodesk.Revit.DB Namespace